def recursive_sum(lst):
    if len(lst) == 0: # if list is empty 
        return 0
    return lst[0] + recursive_sum(lst[1:]) # first element + other element => X+(X+1...)

print(recursive_sum([1, 2, 3, 4])) # result : 10


#explain
"""
1. اگه لیست خالی باشه، صفر برمی‌گردونه

2. اگه لیست خالی نباشه، اولین عدد لیست رو برمی‌داره و به مجموع بقیه اعداد اضافه می‌کنه (اگه دقت کنید توی کد هم از جمع ۱ به بعد یا 1: استفاده شده)

  

برای مثال با ورودی `[1, 2, 3, 4]`:

- اول می‌گه: 1 + مجموع [2, 3, 4]

- بعد میره سراغ مجموع [2, 3, 4]: 2 + مجموع [3, 4]

- بعد میره سراغ مجموع [3, 4]: 3 + مجموع [4]

- بعد میره سراغ مجموع [4]: 4 + مجموع []

- چون [] خالیه، مجموعش میشه 0

- حالا برعکس برمی‌گرده: 4+0=4، 3+4=7، 2+7=9، 1+9=10

- نتیجه نهایی: 10
"""